; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=49, out_folder=htg/blocksworld/training, instance_id=29, seed=2053, goal_proportion=0.1

(define (problem blocksworld-29)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 - object)
 (:init 
    (arm-empty)
    (clear b18)
    (on-table b18)
    (clear b34)
    (on b34 b36)
    (on b36 b11)
    (on b11 b20)
    (on-table b20)
    (clear b24)
    (on b24 b12)
    (on-table b12)
    (clear b22)
    (on b22 b38)
    (on b38 b25)
    (on b25 b14)
    (on b14 b49)
    (on-table b49)
    (clear b41)
    (on-table b41)
    (clear b39)
    (on-table b39)
    (clear b2)
    (on b2 b33)
    (on b33 b7)
    (on b7 b16)
    (on b16 b30)
    (on b30 b27)
    (on-table b27)
    (clear b48)
    (on b48 b4)
    (on b4 b29)
    (on-table b29)
    (clear b46)
    (on b46 b23)
    (on b23 b5)
    (on b5 b28)
    (on-table b28)
    (clear b43)
    (on b43 b26)
    (on-table b26)
    (clear b21)
    (on b21 b45)
    (on b45 b10)
    (on b10 b15)
    (on b15 b44)
    (on b44 b40)
    (on b40 b6)
    (on b6 b1)
    (on b1 b42)
    (on b42 b31)
    (on b31 b47)
    (on b47 b8)
    (on b8 b35)
    (on b35 b32)
    (on b32 b13)
    (on-table b13)
    (clear b9)
    (on b9 b3)
    (on b3 b17)
    (on b17 b37)
    (on b37 b19)
    (on-table b19))
 (:goal  (and 
    (clear b4)
    (on b4 b3)
    (on b3 b2)
    (on b2 b1)
    (on-table b1))))

; plan
1. (unstack b48 b4)
   deleted: (on b48 b4) (clear b48) (arm-empty)
   added: (holding b48) (clear b4)
   goals met: 1 of 5
2. (putdown b48)
   deleted: (holding b48)
   added: (clear b48) (arm-empty) (on-table b48)
   goals met: 1 of 5
3. (unstack b9 b3)
   deleted: (on b9 b3) (clear b9) (arm-empty)
   added: (holding b9) (clear b3)
   goals met: 1 of 5
4. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 1 of 5
5. (unstack b3 b17)
   deleted: (on b3 b17) (clear b3) (arm-empty)
   added: (holding b3) (clear b17)
   goals met: 1 of 5
6. (stack b3 b2)
   deleted: (clear b2) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b2)
   goals met: 2 of 5
7. (unstack b4 b29)
   deleted: (on b4 b29) (clear b4) (arm-empty)
   added: (holding b4) (clear b29)
   goals met: 1 of 5
8. (stack b4 b3)
   deleted: (clear b3) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b3)
   goals met: 3 of 5
9. (unstack b21 b45)
   deleted: (on b21 b45) (clear b21) (arm-empty)
   added: (holding b21) (clear b45)
   goals met: 3 of 5
10. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 3 of 5
11. (unstack b45 b10)
   deleted: (on b45 b10) (clear b45) (arm-empty)
   added: (holding b45) (clear b10)
   goals met: 3 of 5
12. (putdown b45)
   deleted: (holding b45)
   added: (clear b45) (arm-empty) (on-table b45)
   goals met: 3 of 5
13. (unstack b10 b15)
   deleted: (on b10 b15) (clear b10) (arm-empty)
   added: (holding b10) (clear b15)
   goals met: 3 of 5
14. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 3 of 5
15. (unstack b15 b44)
   deleted: (on b15 b44) (clear b15) (arm-empty)
   added: (holding b15) (clear b44)
   goals met: 3 of 5
16. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 3 of 5
17. (unstack b44 b40)
   deleted: (on b44 b40) (clear b44) (arm-empty)
   added: (holding b44) (clear b40)
   goals met: 3 of 5
18. (putdown b44)
   deleted: (holding b44)
   added: (clear b44) (arm-empty) (on-table b44)
   goals met: 3 of 5
19. (unstack b40 b6)
   deleted: (on b40 b6) (clear b40) (arm-empty)
   added: (holding b40) (clear b6)
   goals met: 3 of 5
20. (putdown b40)
   deleted: (holding b40)
   added: (clear b40) (arm-empty) (on-table b40)
   goals met: 3 of 5
21. (unstack b6 b1)
   deleted: (on b6 b1) (clear b6) (arm-empty)
   added: (holding b6) (clear b1)
   goals met: 3 of 5
22. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 3 of 5
23. (unstack b1 b42)
   deleted: (on b1 b42) (clear b1) (arm-empty)
   added: (holding b1) (clear b42)
   goals met: 3 of 5
24. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 4 of 5
25. (unstack b4 b3)
   deleted: (on b4 b3) (clear b4) (arm-empty)
   added: (holding b4) (clear b3)
   goals met: 2 of 5
26. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 3 of 5
27. (unstack b3 b2)
   deleted: (on b3 b2) (clear b3) (arm-empty)
   added: (holding b3) (clear b2)
   goals met: 2 of 5
28. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 2 of 5
29. (unstack b2 b33)
   deleted: (on b2 b33) (clear b2) (arm-empty)
   added: (holding b2) (clear b33)
   goals met: 2 of 5
30. (stack b2 b1)
   deleted: (clear b1) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b1)
   goals met: 3 of 5
31. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 3 of 5
32. (stack b3 b2)
   deleted: (clear b2) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b2)
   goals met: 4 of 5
33. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 3 of 5
34. (stack b4 b3)
   deleted: (clear b3) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b3)
   goals met: 5 of 5
